espressif/esp-idf/examples/ethernet/iperf/sdkconfig.ci.default_yt8531_esp32s31
# Common / performance options live in sdkconfig.defaults

CONFIG_IDF_TARGET="esp32s31"

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# Config Ethernet Init
CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_YT8531=y
